ogneyar/AsmStudy/STM32asm/Examples/projectLCD/src/stm32f40x_def.inc
@*******************  Bit definition for CAN_IER register  *******************/
.equ  CAN_IER_TMEIE                       ,0x00000001         @<Transmit Mailbox Empty Interrupt Enable */
.equ  CAN_IER_FMPIE0                      ,0x00000002         @<FIFO Message Pending Interrupt Enable */
.equ  CAN_IER_FFIE0                       ,0x00000004         @<FIFO Full Interrupt Enable */
.equ  CAN_IER_FOVIE0                      ,0x00000008         @<FIFO Overrun Interrupt Enable */
.equ  CAN_IER_FMPIE1                      ,0x00000010         @<FIFO Message Pending Interrupt Enable */
.equ  CAN_IER_FFIE1                       ,0x00000020         @<FIFO Full Interrupt Enable */
.equ  CAN_IER_FOVIE1                      ,0x00000040         @<FIFO Overrun Interrupt Enable */
.equ  CAN_IER_EWGIE                       ,0x00000100         @<Error Warning Interrupt Enable */
.equ  CAN_IER_EPVIE                       ,0x00000200         @<Error Passive Interrupt Enable */
.equ  CAN_IER_BOFIE                       ,0x00000400         @<Bus-Off Interrupt Enable */
.equ  CAN_IER_LECIE                       ,0x00000800         @<Last Error Code Interrupt Enable */
.equ  CAN_IER_ERRIE                       ,0x00008000         @<Error Interrupt Enable */
.equ  CAN_IER_WKUIE                       ,0x00010000         @<Wakeup Interrupt Enable */
.equ  CAN_IER_SLKIE                       ,0x00020000         @<Sleep Interrupt Enable */

@*******************  Bit definition for CAN_ESR register  *******************/
.equ  CAN_ESR_EWGF                        ,0x00000001         @<Error Warning Flag */
.equ  CAN_ESR_EPVF                        ,0x00000002         @<Error Passive Flag */
.equ  CAN_ESR_BOFF                        ,0x00000004         @<Bus-Off Flag */

.equ  CAN_ESR_LEC                         ,0x00000070         @<LEC[2:0] bits (Last Error Code) */
.equ  CAN_ESR_LEC_0                       ,0x00000010         @<Bit 0 */
.equ  CAN_ESR_LEC_1                       ,0x00000020         @<Bit 1 */
.equ  CAN_ESR_LEC_2                       ,0x00000040         @<Bit 2 */

.equ  CAN_ESR_TEC                         ,0x00FF0000         @<Least significant byte of the 9-bit Transmit Error Counter */
.equ  CAN_ESR_REC                         ,0xFF000000         @<Receive Error Counter */

@******************  Bit definition for CAN_BTR register  ********************/
.equ  CAN_BTR_BRP                         ,0x000003FF         @<Baud Rate Prescaler */
.equ  CAN_BTR_TS1                         ,0x000F0000         @<Time Segment 1 */
.equ  CAN_BTR_TS2                         ,0x00700000         @<Time Segment 2 */
.equ  CAN_BTR_SJW                         ,0x03000000         @<Resynchronization Jump Width */
.equ  CAN_BTR_LBKM                        ,0x40000000         @<Loop Back Mode (Debug) */
.equ  CAN_BTR_SILM                        ,0x80000000         @<Silent Mode */

@<Mailbox registers */
@*****************  Bit definition for CAN_TI0R register  ********************/
.equ  CAN_TI0R_TXRQ                       ,0x00000001         @<Transmit Mailbox Request */
.equ  CAN_TI0R_RTR                        ,0x00000002         @<Remote Transmission Request */
.equ  CAN_TI0R_IDE                        ,0x00000004         @<Identifier Extension */
.equ  CAN_TI0R_EXID                       ,0x001FFFF8         @<Extended Identifier */
.equ  CAN_TI0R_STID                       ,0xFFE00000         @<Standard Identifier or Extended Identifier */

@*****************  Bit definition for CAN_TDT0R register  *******************/
.equ  CAN_TDT0R_DLC                       ,0x0000000F         @<Data Length Code */
.equ  CAN_TDT0R_TGT                       ,0x00000100         @<Transmit Global Time */
.equ  CAN_TDT0R_TIME                      ,0xFFFF0000         @<Message Time Stamp */

@*****************  Bit definition for CAN_TDL0R register  *******************/
.equ  CAN_TDL0R_DATA0                     ,0x000000FF         @<Data byte 0 */
.equ  CAN_TDL0R_DATA1                     ,0x0000FF00         @<Data byte 1 */
.equ  CAN_TDL0R_DATA2                     ,0x00FF0000         @<Data byte 2 */
.equ  CAN_TDL0R_DATA3                     ,0xFF000000         @<Data byte 3 */

@*****************  Bit definition for CAN_TDH0R register  *******************/
.equ  CAN_TDH0R_DATA4                     ,0x000000FF         @<Data byte 4 */
.equ  CAN_TDH0R_DATA5                     ,0x0000FF00         @<Data byte 5 */
.equ  CAN_TDH0R_DATA6                     ,0x00FF0000         @<Data byte 6 */
.equ  CAN_TDH0R_DATA7                     ,0xFF000000         @<Data byte 7 */

@******************  Bit definition for CAN_TI1R register  *******************/
.equ  CAN_TI1R_TXRQ                       ,0x00000001         @<Transmit Mailbox Request */
.equ  CAN_TI1R_RTR                        ,0x00000002         @<Remote Transmission Request */
.equ  CAN_TI1R_IDE                        ,0x00000004         @<Identifier Extension */
.equ  CAN_TI1R_EXID                       ,0x001FFFF8         @<Extended Identifier */
.equ  CAN_TI1R_STID                       ,0xFFE00000         @<Standard Identifier or Extended Identifier */

@******************  Bit definition for CAN_TDT1R register  ******************/
.equ  CAN_TDT1R_DLC                       ,0x0000000F         @<Data Length Code */
.equ  CAN_TDT1R_TGT                       ,0x00000100         @<Transmit Global Time */
.equ  CAN_TDT1R_TIME                      ,0xFFFF0000         @<Message Time Stamp */

@******************  Bit definition for CAN_TDL1R register  ******************/
.equ  CAN_TDL1R_DATA0                     ,0x000000FF         @<Data byte 0 */
.equ  CAN_TDL1R_DATA1                     ,0x0000FF00         @<Data byte 1 */
.equ  CAN_TDL1R_DATA2                     ,0x00FF0000         @<Data byte 2 */
.equ  CAN_TDL1R_DATA3                     ,0xFF000000         @<Data byte 3 */

@******************  Bit definition for CAN_TDH1R register  ******************/
.equ  CAN_TDH1R_DATA4                     ,0x000000FF         @<Data byte 4 */
.equ  CAN_TDH1R_DATA5                     ,0x0000FF00         @<Data byte 5 */
.equ  CAN_TDH1R_DATA6                     ,0x00FF0000         @<Data byte 6 */
.equ  CAN_TDH1R_DATA7                     ,0xFF000000         @<Data byte 7 */

@******************  Bit definition for CAN_TI2R register  *******************/
.equ  CAN_TI2R_TXRQ                       ,0x00000001         @<Transmit Mailbox Request */
.equ  CAN_TI2R_RTR                        ,0x00000002         @<Remote Transmission Request */
.equ  CAN_TI2R_IDE                        ,0x00000004         @<Identifier Extension */
.equ  CAN_TI2R_EXID                       ,0x001FFFF8         @<Extended identifier */
.equ  CAN_TI2R_STID                       ,0xFFE00000         @<Standard Identifier or Extended Identifier */

@******************  Bit definition for CAN_TDT2R register  ******************/  
.equ  CAN_TDT2R_DLC                       ,0x0000000F         @<Data Length Code */
.equ  CAN_TDT2R_TGT                       ,0x00000100         @<Transmit Global Time */
.equ  CAN_TDT2R_TIME                      ,0xFFFF0000         @<Message Time Stamp */

@******************  Bit definition for CAN_TDL2R register  ******************/
.equ  CAN_TDL2R_DATA0                     ,0x000000FF         @<Data byte 0 */
.equ  CAN_TDL2R_DATA1                     ,0x0000FF00         @<Data byte 1 */
.equ  CAN_TDL2R_DATA2                     ,0x00FF0000         @<Data byte 2 */
.equ  CAN_TDL2R_DATA3                     ,0xFF000000         @<Data byte 3 */

@******************  Bit definition for CAN_TDH2R register  ******************/
.equ  CAN_TDH2R_DATA4                     ,0x000000FF         @<Data byte 4 */
.equ  CAN_TDH2R_DATA5                     ,0x0000FF00         @<Data byte 5 */
.equ  CAN_TDH2R_DATA6                     ,0x00FF0000         @<Data byte 6 */
.equ  CAN_TDH2R_DATA7                     ,0xFF000000         @<Data byte 7 */

@******************  Bit definition for CAN_RI0R register  *******************/
.equ  CAN_RI0R_RTR                        ,0x00000002         @<Remote Transmission Request */
.equ  CAN_RI0R_IDE                        ,0x00000004         @<Identifier Extension */
.equ  CAN_RI0R_EXID                       ,0x001FFFF8         @<Extended Identifier */
.equ  CAN_RI0R_STID                       ,0xFFE00000         @<Standard Identifier or Extended Identifier */

@******************  Bit definition for CAN_RDT0R register  ******************/
.equ  CAN_RDT0R_DLC                       ,0x0000000F         @<Data Length Code */
.equ  CAN_RDT0R_FMI                       ,0x0000FF00         @<Filter Match Index */
.equ  CAN_RDT0R_TIME                      ,0xFFFF0000         @<Message Time Stamp */

