ogneyar/AsmStudy/STM32asm/Examples/projectLCD/src/stm32f40x_def.inc
@******************  Bit definition for CAN_F3R2 register  *******************/
.equ  CAN_F3R2_FB0                        ,0x00000001         @<Filter bit 0 */
.equ  CAN_F3R2_FB1                        ,0x00000002         @<Filter bit 1 */
.equ  CAN_F3R2_FB2                        ,0x00000004         @<Filter bit 2 */
.equ  CAN_F3R2_FB3                        ,0x00000008         @<Filter bit 3 */
.equ  CAN_F3R2_FB4                        ,0x00000010         @<Filter bit 4 */
.equ  CAN_F3R2_FB5                        ,0x00000020         @<Filter bit 5 */
.equ  CAN_F3R2_FB6                        ,0x00000040         @<Filter bit 6 */
.equ  CAN_F3R2_FB7                        ,0x00000080         @<Filter bit 7 */
.equ  CAN_F3R2_FB8                        ,0x00000100         @<Filter bit 8 */
.equ  CAN_F3R2_FB9                        ,0x00000200         @<Filter bit 9 */
.equ  CAN_F3R2_FB10                       ,0x00000400         @<Filter bit 10 */
.equ  CAN_F3R2_FB11                       ,0x00000800         @<Filter bit 11 */
.equ  CAN_F3R2_FB12                       ,0x00001000         @<Filter bit 12 */
.equ  CAN_F3R2_FB13                       ,0x00002000         @<Filter bit 13 */
.equ  CAN_F3R2_FB14                       ,0x00004000         @<Filter bit 14 */
.equ  CAN_F3R2_FB15                       ,0x00008000         @<Filter bit 15 */
.equ  CAN_F3R2_FB16                       ,0x00010000         @<Filter bit 16 */
.equ  CAN_F3R2_FB17                       ,0x00020000         @<Filter bit 17 */
.equ  CAN_F3R2_FB18                       ,0x00040000         @<Filter bit 18 */
.equ  CAN_F3R2_FB19                       ,0x00080000         @<Filter bit 19 */
.equ  CAN_F3R2_FB20                       ,0x00100000         @<Filter bit 20 */
.equ  CAN_F3R2_FB21                       ,0x00200000         @<Filter bit 21 */
.equ  CAN_F3R2_FB22                       ,0x00400000         @<Filter bit 22 */
.equ  CAN_F3R2_FB23                       ,0x00800000         @<Filter bit 23 */
.equ  CAN_F3R2_FB24                       ,0x01000000         @<Filter bit 24 */
.equ  CAN_F3R2_FB25                       ,0x02000000         @<Filter bit 25 */
.equ  CAN_F3R2_FB26                       ,0x04000000         @<Filter bit 26 */
.equ  CAN_F3R2_FB27                       ,0x08000000         @<Filter bit 27 */
.equ  CAN_F3R2_FB28                       ,0x10000000         @<Filter bit 28 */
.equ  CAN_F3R2_FB29                       ,0x20000000         @<Filter bit 29 */
.equ  CAN_F3R2_FB30                       ,0x40000000         @<Filter bit 30 */
.equ  CAN_F3R2_FB31                       ,0x80000000         @<Filter bit 31 */

@******************  Bit definition for CAN_F4R2 register  *******************/
.equ  CAN_F4R2_FB0                        ,0x00000001         @<Filter bit 0 */
.equ  CAN_F4R2_FB1                        ,0x00000002         @<Filter bit 1 */
.equ  CAN_F4R2_FB2                        ,0x00000004         @<Filter bit 2 */
.equ  CAN_F4R2_FB3                        ,0x00000008         @<Filter bit 3 */
.equ  CAN_F4R2_FB4                        ,0x00000010         @<Filter bit 4 */
.equ  CAN_F4R2_FB5                        ,0x00000020         @<Filter bit 5 */
.equ  CAN_F4R2_FB6                        ,0x00000040         @<Filter bit 6 */
.equ  CAN_F4R2_FB7                        ,0x00000080         @<Filter bit 7 */
.equ  CAN_F4R2_FB8                        ,0x00000100         @<Filter bit 8 */
.equ  CAN_F4R2_FB9                        ,0x00000200         @<Filter bit 9 */
.equ  CAN_F4R2_FB10                       ,0x00000400         @<Filter bit 10 */
.equ  CAN_F4R2_FB11                       ,0x00000800         @<Filter bit 11 */
.equ  CAN_F4R2_FB12                       ,0x00001000         @<Filter bit 12 */
.equ  CAN_F4R2_FB13                       ,0x00002000         @<Filter bit 13 */
.equ  CAN_F4R2_FB14                       ,0x00004000         @<Filter bit 14 */
.equ  CAN_F4R2_FB15                       ,0x00008000         @<Filter bit 15 */
.equ  CAN_F4R2_FB16                       ,0x00010000         @<Filter bit 16 */
.equ  CAN_F4R2_FB17                       ,0x00020000         @<Filter bit 17 */
.equ  CAN_F4R2_FB18                       ,0x00040000         @<Filter bit 18 */
.equ  CAN_F4R2_FB19                       ,0x00080000         @<Filter bit 19 */
.equ  CAN_F4R2_FB20                       ,0x00100000         @<Filter bit 20 */
.equ  CAN_F4R2_FB21                       ,0x00200000         @<Filter bit 21 */
.equ  CAN_F4R2_FB22                       ,0x00400000         @<Filter bit 22 */
.equ  CAN_F4R2_FB23                       ,0x00800000         @<Filter bit 23 */
.equ  CAN_F4R2_FB24                       ,0x01000000         @<Filter bit 24 */
.equ  CAN_F4R2_FB25                       ,0x02000000         @<Filter bit 25 */
.equ  CAN_F4R2_FB26                       ,0x04000000         @<Filter bit 26 */
.equ  CAN_F4R2_FB27                       ,0x08000000         @<Filter bit 27 */
.equ  CAN_F4R2_FB28                       ,0x10000000         @<Filter bit 28 */
.equ  CAN_F4R2_FB29                       ,0x20000000         @<Filter bit 29 */
.equ  CAN_F4R2_FB30                       ,0x40000000         @<Filter bit 30 */
.equ  CAN_F4R2_FB31                       ,0x80000000         @<Filter bit 31 */

@******************  Bit definition for CAN_F5R2 register  *******************/
.equ  CAN_F5R2_FB0                        ,0x00000001         @<Filter bit 0 */
.equ  CAN_F5R2_FB1                        ,0x00000002         @<Filter bit 1 */
.equ  CAN_F5R2_FB2                        ,0x00000004         @<Filter bit 2 */
.equ  CAN_F5R2_FB3                        ,0x00000008         @<Filter bit 3 */
.equ  CAN_F5R2_FB4                        ,0x00000010         @<Filter bit 4 */
.equ  CAN_F5R2_FB5                        ,0x00000020         @<Filter bit 5 */
.equ  CAN_F5R2_FB6                        ,0x00000040         @<Filter bit 6 */
.equ  CAN_F5R2_FB7                        ,0x00000080         @<Filter bit 7 */
.equ  CAN_F5R2_FB8                        ,0x00000100         @<Filter bit 8 */
.equ  CAN_F5R2_FB9                        ,0x00000200         @<Filter bit 9 */
.equ  CAN_F5R2_FB10                       ,0x00000400         @<Filter bit 10 */
.equ  CAN_F5R2_FB11                       ,0x00000800         @<Filter bit 11 */
.equ  CAN_F5R2_FB12                       ,0x00001000         @<Filter bit 12 */
.equ  CAN_F5R2_FB13                       ,0x00002000         @<Filter bit 13 */
.equ  CAN_F5R2_FB14                       ,0x00004000         @<Filter bit 14 */
.equ  CAN_F5R2_FB15                       ,0x00008000         @<Filter bit 15 */
.equ  CAN_F5R2_FB16                       ,0x00010000         @<Filter bit 16 */
.equ  CAN_F5R2_FB17                       ,0x00020000         @<Filter bit 17 */
.equ  CAN_F5R2_FB18                       ,0x00040000         @<Filter bit 18 */
.equ  CAN_F5R2_FB19                       ,0x00080000         @<Filter bit 19 */
.equ  CAN_F5R2_FB20                       ,0x00100000         @<Filter bit 20 */
.equ  CAN_F5R2_FB21                       ,0x00200000         @<Filter bit 21 */
.equ  CAN_F5R2_FB22                       ,0x00400000         @<Filter bit 22 */
.equ  CAN_F5R2_FB23                       ,0x00800000         @<Filter bit 23 */
.equ  CAN_F5R2_FB24                       ,0x01000000         @<Filter bit 24 */
.equ  CAN_F5R2_FB25                       ,0x02000000         @<Filter bit 25 */
.equ  CAN_F5R2_FB26                       ,0x04000000         @<Filter bit 26 */
.equ  CAN_F5R2_FB27                       ,0x08000000         @<Filter bit 27 */
.equ  CAN_F5R2_FB28                       ,0x10000000         @<Filter bit 28 */
.equ  CAN_F5R2_FB29                       ,0x20000000         @<Filter bit 29 */
.equ  CAN_F5R2_FB30                       ,0x40000000         @<Filter bit 30 */
.equ  CAN_F5R2_FB31                       ,0x80000000         @<Filter bit 31 */

@******************  Bit definition for CAN_F6R2 register  *******************/
.equ  CAN_F6R2_FB0                        ,0x00000001         @<Filter bit 0 */
.equ  CAN_F6R2_FB1                        ,0x00000002         @<Filter bit 1 */
.equ  CAN_F6R2_FB2                        ,0x00000004         @<Filter bit 2 */
.equ  CAN_F6R2_FB3                        ,0x00000008         @<Filter bit 3 */
.equ  CAN_F6R2_FB4                        ,0x00000010         @<Filter bit 4 */
.equ  CAN_F6R2_FB5                        ,0x00000020         @<Filter bit 5 */
.equ  CAN_F6R2_FB6                        ,0x00000040         @<Filter bit 6 */
.equ  CAN_F6R2_FB7                        ,0x00000080         @<Filter bit 7 */
.equ  CAN_F6R2_FB8                        ,0x00000100         @<Filter bit 8 */
.equ  CAN_F6R2_FB9                        ,0x00000200         @<Filter bit 9 */
.equ  CAN_F6R2_FB10                       ,0x00000400         @<Filter bit 10 */
.equ  CAN_F6R2_FB11                       ,0x00000800         @<Filter bit 11 */
.equ  CAN_F6R2_FB12                       ,0x00001000         @<Filter bit 12 */
.equ  CAN_F6R2_FB13                       ,0x00002000         @<Filter bit 13 */
.equ  CAN_F6R2_FB14                       ,0x00004000         @<Filter bit 14 */
.equ  CAN_F6R2_FB15                       ,0x00008000         @<Filter bit 15 */
.equ  CAN_F6R2_FB16                       ,0x00010000         @<Filter bit 16 */
.equ  CAN_F6R2_FB17                       ,0x00020000         @<Filter bit 17 */
.equ  CAN_F6R2_FB18                       ,0x00040000         @<Filter bit 18 */
.equ  CAN_F6R2_FB19                       ,0x00080000         @<Filter bit 19 */
.equ  CAN_F6R2_FB20                       ,0x00100000         @<Filter bit 20 */
.equ  CAN_F6R2_FB21                       ,0x00200000         @<Filter bit 21 */
.equ  CAN_F6R2_FB22                       ,0x00400000         @<Filter bit 22 */
.equ  CAN_F6R2_FB23                       ,0x00800000         @<Filter bit 23 */
.equ  CAN_F6R2_FB24                       ,0x01000000         @<Filter bit 24 */
.equ  CAN_F6R2_FB25                       ,0x02000000         @<Filter bit 25 */
.equ  CAN_F6R2_FB26                       ,0x04000000         @<Filter bit 26 */
.equ  CAN_F6R2_FB27                       ,0x08000000         @<Filter bit 27 */
.equ  CAN_F6R2_FB28                       ,0x10000000         @<Filter bit 28 */
.equ  CAN_F6R2_FB29                       ,0x20000000         @<Filter bit 29 */
.equ  CAN_F6R2_FB30                       ,0x40000000         @<Filter bit 30 */
.equ  CAN_F6R2_FB31                       ,0x80000000         @<Filter bit 31 */

