ogneyar/AsmStudy/STM32asm/Examples/projectLCD/src/stm32f40x_def.inc
@*****************  Bit definition for DAC_DHR8R2 register  ******************/
.equ  DAC_DHR8R2_DACC2DHR                 ,0xFF               @<DAC channel2 8-bit Right aligned data */

@****************  Bit definition for DAC_DHR12RD register  ******************/
.equ  DAC_DHR12RD_DACC1DHR                ,0x00000FFF         @<DAC channel1 12-bit Right aligned data */
.equ  DAC_DHR12RD_DACC2DHR                ,0x0FFF0000         @<DAC channel2 12-bit Right aligned data */

@****************  Bit definition for DAC_DHR12LD register  ******************/
.equ  DAC_DHR12LD_DACC1DHR                ,0x0000FFF0         @<DAC channel1 12-bit Left aligned data */
.equ  DAC_DHR12LD_DACC2DHR                ,0xFFF00000         @<DAC channel2 12-bit Left aligned data */

@*****************  Bit definition for DAC_DHR8RD register  ******************/
.equ  DAC_DHR8RD_DACC1DHR                 ,0x00FF            @<DAC channel1 8-bit Right aligned data */
.equ  DAC_DHR8RD_DACC2DHR                 ,0xFF00            @<DAC channel2 8-bit Right aligned data */

@******************  Bit definition for DAC_DOR1 register  *******************/
.equ  DAC_DOR1_DACC1DOR                   ,0x0FFF            @<DAC channel1 data output */

@******************  Bit definition for DAC_DOR2 register  *******************/
.equ  DAC_DOR2_DACC2DOR                   ,0x0FFF            @<DAC channel2 data output */

@*******************  Bit definition for DAC_SR register  ********************/
.equ  DAC_SR_DMAUDR1                      ,0x00002000         @<DAC channel1 DMA underrun flag */
.equ  DAC_SR_DMAUDR2                      ,0x20000000         @<DAC channel2 DMA underrun flag */

@*****************************************************************************/
@                                                                            */
@                                 Debug MCU                                  */
@                                                                            */
@*****************************************************************************/

@*****************************************************************************/
@                                                                            */
@                                    DCMI                                    */
@                                                                            */
@*****************************************************************************/
@*******************  Bits definition for DCMI_CR register  ******************/
.equ DCMI_CR_CAPTURE                      ,0x00000001 
.equ DCMI_CR_CM                           ,0x00000002 
.equ DCMI_CR_CROP                         ,0x00000004 
.equ DCMI_CR_JPEG                         ,0x00000008 
.equ DCMI_CR_ESS                          ,0x00000010 
.equ DCMI_CR_PCKPOL                       ,0x00000020 
.equ DCMI_CR_HSPOL                        ,0x00000040 
.equ DCMI_CR_VSPOL                        ,0x00000080 
.equ DCMI_CR_FCRC_0                       ,0x00000100 
.equ DCMI_CR_FCRC_1                       ,0x00000200 
.equ DCMI_CR_EDM_0                        ,0x00000400 
.equ DCMI_CR_EDM_1                        ,0x00000800 
.equ DCMI_CR_CRE                          ,0x00001000 
.equ DCMI_CR_ENABLE                       ,0x00004000 

@*******************  Bits definition for DCMI_SR register  ******************/
.equ DCMI_SR_HSYNC                        ,0x00000001 
.equ DCMI_SR_VSYNC                        ,0x00000002 
.equ DCMI_SR_FNE                          ,0x00000004 

@*******************  Bits definition for DCMI_RISR register  ****************/
.equ DCMI_RISR_FRAME_RIS                  ,0x00000001 
.equ DCMI_RISR_OVF_RIS                    ,0x00000002 
.equ DCMI_RISR_ERR_RIS                    ,0x00000004 
.equ DCMI_RISR_VSYNC_RIS                  ,0x00000008 
.equ DCMI_RISR_LINE_RIS                   ,0x00000010 

@*******************  Bits definition for DCMI_IER register  *****************/
.equ DCMI_IER_FRAME_IE                    ,0x00000001 
.equ DCMI_IER_OVF_IE                      ,0x00000002 
.equ DCMI_IER_ERR_IE                      ,0x00000004 
.equ DCMI_IER_VSYNC_IE                    ,0x00000008 
.equ DCMI_IER_LINE_IE                     ,0x00000010 

@*******************  Bits definition for DCMI_MISR register  ****************/
.equ DCMI_MISR_FRAME_MIS                  ,0x00000001 
.equ DCMI_MISR_OVF_MIS                    ,0x00000002 
.equ DCMI_MISR_ERR_MIS                    ,0x00000004 
.equ DCMI_MISR_VSYNC_MIS                  ,0x00000008 
.equ DCMI_MISR_LINE_MIS                   ,0x00000010 

@*******************  Bits definition for DCMI_ICR register  *****************/
.equ DCMI_ICR_FRAME_ISC                   ,0x00000001 
.equ DCMI_ICR_OVF_ISC                     ,0x00000002 
.equ DCMI_ICR_ERR_ISC                     ,0x00000004 
.equ DCMI_ICR_VSYNC_ISC                   ,0x00000008 
.equ DCMI_ICR_LINE_ISC                    ,0x00000010 

@*****************************************************************************/
@                                                                            */
@                             DMA Controller                                 */
@                                                                            */
@*****************************************************************************/
@*******************  Bits definition for DMA_SxCR register  *****************/ 
.equ DMA_SxCR_CHSEL                       ,0x0E000000 
.equ DMA_SxCR_CHSEL_0                     ,0x02000000 
.equ DMA_SxCR_CHSEL_1                     ,0x04000000 
.equ DMA_SxCR_CHSEL_2                     ,0x08000000  
.equ DMA_SxCR_MBURST                      ,0x01800000 
.equ DMA_SxCR_MBURST_0                    ,0x00800000 
.equ DMA_SxCR_MBURST_1                    ,0x01000000 
.equ DMA_SxCR_PBURST                      ,0x00600000 
.equ DMA_SxCR_PBURST_0                    ,0x00200000 
.equ DMA_SxCR_PBURST_1                    ,0x00400000 
.equ DMA_SxCR_ACK                         ,0x00100000 
.equ DMA_SxCR_CT                          ,0x00080000   
.equ DMA_SxCR_DBM                         ,0x00040000 
.equ DMA_SxCR_PL                          ,0x00030000 
.equ DMA_SxCR_PL_0                        ,0x00010000 
.equ DMA_SxCR_PL_1                        ,0x00020000 
.equ DMA_SxCR_PINCOS                      ,0x00008000 
.equ DMA_SxCR_MSIZE                       ,0x00006000 
.equ DMA_SxCR_MSIZE_0                     ,0x00002000 
.equ DMA_SxCR_MSIZE_1                     ,0x00004000 
.equ DMA_SxCR_PSIZE                       ,0x00001800 
.equ DMA_SxCR_PSIZE_0                     ,0x00000800 
.equ DMA_SxCR_PSIZE_1                     ,0x00001000 
.equ DMA_SxCR_MINC                        ,0x00000400 
.equ DMA_SxCR_PINC                        ,0x00000200 
.equ DMA_SxCR_CIRC                        ,0x00000100 
.equ DMA_SxCR_DIR                         ,0x000000C0 
.equ DMA_SxCR_DIR_0                       ,0x00000040 
.equ DMA_SxCR_DIR_1                       ,0x00000080 
.equ DMA_SxCR_PFCTRL                      ,0x00000020 
.equ DMA_SxCR_TCIE                        ,0x00000010 
.equ DMA_SxCR_HTIE                        ,0x00000008 
.equ DMA_SxCR_TEIE                        ,0x00000004 
.equ DMA_SxCR_DMEIE                       ,0x00000002 
.equ DMA_SxCR_EN                          ,0x00000001 

@*******************  Bits definition for DMA_SxCNDTR register  **************/
.equ DMA_SxNDT                            ,0x0000FFFF 
.equ DMA_SxNDT_0                          ,0x00000001 
.equ DMA_SxNDT_1                          ,0x00000002 
.equ DMA_SxNDT_2                          ,0x00000004 
.equ DMA_SxNDT_3                          ,0x00000008 
.equ DMA_SxNDT_4                          ,0x00000010 
.equ DMA_SxNDT_5                          ,0x00000020 
.equ DMA_SxNDT_6                          ,0x00000040 
.equ DMA_SxNDT_7                          ,0x00000080 
.equ DMA_SxNDT_8                          ,0x00000100 
.equ DMA_SxNDT_9                          ,0x00000200 
.equ DMA_SxNDT_10                         ,0x00000400 
.equ DMA_SxNDT_11                         ,0x00000800 
.equ DMA_SxNDT_12                         ,0x00001000 
.equ DMA_SxNDT_13                         ,0x00002000 
.equ DMA_SxNDT_14                         ,0x00004000 
.equ DMA_SxNDT_15                         ,0x00008000 

@*******************  Bits definition for DMA_SxFCR register  ****************/ 
.equ DMA_SxFCR_FEIE                       ,0x00000080 
.equ DMA_SxFCR_FS                         ,0x00000038 
.equ DMA_SxFCR_FS_0                       ,0x00000008 
.equ DMA_SxFCR_FS_1                       ,0x00000010 
.equ DMA_SxFCR_FS_2                       ,0x00000020 
.equ DMA_SxFCR_DMDIS                      ,0x00000004 
.equ DMA_SxFCR_FTH                        ,0x00000003 
.equ DMA_SxFCR_FTH_0                      ,0x00000001 
.equ DMA_SxFCR_FTH_1                      ,0x00000002 

