ogneyar/AsmStudy/STM32asm/Examples/projectLCD/src/stm32f40x_def.inc
.equ GPIO_ODR                             ,0x14                            
@*****************  Bits definition for GPIO_ODR register  *******************/
.equ GPIO_ODR_ODR_0                       ,0x00000001
.equ GPIO_ODR_ODR_1                       ,0x00000002
.equ GPIO_ODR_ODR_2                       ,0x00000004
.equ GPIO_ODR_ODR_3                       ,0x00000008
.equ GPIO_ODR_ODR_4                       ,0x00000010
.equ GPIO_ODR_ODR_5                       ,0x00000020
.equ GPIO_ODR_ODR_6                       ,0x00000040
.equ GPIO_ODR_ODR_7                       ,0x00000080
.equ GPIO_ODR_ODR_8                       ,0x00000100
.equ GPIO_ODR_ODR_9                       ,0x00000200
.equ GPIO_ODR_ODR_10                      ,0x00000400
.equ GPIO_ODR_ODR_11                      ,0x00000800
.equ GPIO_ODR_ODR_12                      ,0x00001000
.equ GPIO_ODR_ODR_13                      ,0x00002000
.equ GPIO_ODR_ODR_14                      ,0x00004000
.equ GPIO_ODR_ODR_15                      ,0x00008000

@ Old GPIO_ODR register bits definition, maintained for legacy purpose */
.equ GPIO_OTYPER_ODR_0                    ,GPIO_ODR_ODR_0
.equ GPIO_OTYPER_ODR_1                    ,GPIO_ODR_ODR_1
.equ GPIO_OTYPER_ODR_2                    ,GPIO_ODR_ODR_2
.equ GPIO_OTYPER_ODR_3                    ,GPIO_ODR_ODR_3
.equ GPIO_OTYPER_ODR_4                    ,GPIO_ODR_ODR_4
.equ GPIO_OTYPER_ODR_5                    ,GPIO_ODR_ODR_5
.equ GPIO_OTYPER_ODR_6                    ,GPIO_ODR_ODR_6
.equ GPIO_OTYPER_ODR_7                    ,GPIO_ODR_ODR_7
.equ GPIO_OTYPER_ODR_8                    ,GPIO_ODR_ODR_8
.equ GPIO_OTYPER_ODR_9                    ,GPIO_ODR_ODR_9
.equ GPIO_OTYPER_ODR_10                   ,GPIO_ODR_ODR_10
.equ GPIO_OTYPER_ODR_11                   ,GPIO_ODR_ODR_11
.equ GPIO_OTYPER_ODR_12                   ,GPIO_ODR_ODR_12
.equ GPIO_OTYPER_ODR_13                   ,GPIO_ODR_ODR_13
.equ GPIO_OTYPER_ODR_14                   ,GPIO_ODR_ODR_14
.equ GPIO_OTYPER_ODR_15                   ,GPIO_ODR_ODR_15

.equ GPIO_BSRR                            ,0x18
@*****************  Bits definition for GPIO_BSRR register  ******************/
.equ GPIO_BSRR_BS_0                       ,0x00000001
.equ GPIO_BSRR_BS_1                       ,0x00000002
.equ GPIO_BSRR_BS_2                       ,0x00000004
.equ GPIO_BSRR_BS_3                       ,0x00000008
.equ GPIO_BSRR_BS_4                       ,0x00000010
.equ GPIO_BSRR_BS_5                       ,0x00000020
.equ GPIO_BSRR_BS_6                       ,0x00000040
.equ GPIO_BSRR_BS_7                       ,0x00000080
.equ GPIO_BSRR_BS_8                       ,0x00000100
.equ GPIO_BSRR_BS_9                       ,0x00000200
.equ GPIO_BSRR_BS_10                      ,0x00000400
.equ GPIO_BSRR_BS_11                      ,0x00000800
.equ GPIO_BSRR_BS_12                      ,0x00001000
.equ GPIO_BSRR_BS_13                      ,0x00002000
.equ GPIO_BSRR_BS_14                      ,0x00004000
.equ GPIO_BSRR_BS_15                      ,0x00008000
.equ GPIO_BSRR_BR_0                       ,0x00010000
.equ GPIO_BSRR_BR_1                       ,0x00020000
.equ GPIO_BSRR_BR_2                       ,0x00040000
.equ GPIO_BSRR_BR_3                       ,0x00080000
.equ GPIO_BSRR_BR_4                       ,0x00100000
.equ GPIO_BSRR_BR_5                       ,0x00200000
.equ GPIO_BSRR_BR_6                       ,0x00400000
.equ GPIO_BSRR_BR_7                       ,0x00800000
.equ GPIO_BSRR_BR_8                       ,0x01000000
.equ GPIO_BSRR_BR_9                       ,0x02000000
.equ GPIO_BSRR_BR_10                      ,0x04000000
.equ GPIO_BSRR_BR_11                      ,0x08000000
.equ GPIO_BSRR_BR_12                      ,0x10000000
.equ GPIO_BSRR_BR_13                      ,0x20000000
.equ GPIO_BSRR_BR_14                      ,0x40000000
.equ GPIO_BSRR_BR_15                      ,0x80000000

.equ GPIO_LCKR				  ,0x1C

.equ GPIO_AFRL				  ,0x20  @ регистр указания альтернативных функций
.equ GPIO_AFRH				  ,0x24  @ регистр указания альтернативных функций
@*****************  Bits definition for GPIO_AFRx register  ********************/
.equ AFRx_MSK                         ,0x0F

.equ AFRx_AF0                         ,0x00
.equ AFRx_AF1                         ,0x01
.equ AFRx_AF2                         ,0x02
.equ AFRx_AF3                         ,0x03
.equ AFRx_AF4                         ,0x04
.equ AFRx_AF5                         ,0x05
.equ AFRx_AF6                         ,0x06
.equ AFRx_AF7                         ,0x07
.equ AFRx_AF8                         ,0x08
.equ AFRx_AF9                         ,0x09
.equ AFRx_AF10                        ,0x0A
.equ AFRx_AF11                        ,0x0B
.equ AFRx_AF12                        ,0x0C
.equ AFRx_AF13                        ,0x0D
.equ AFRx_AF14                        ,0x0E
.equ AFRx_AF15                        ,0x0F

@******************************************************************************/
@*                                                                            */
@*                                    HASH                                    */
@*                                                                            */
@******************************************************************************/
@*****************  Bits definition for HASH_CR register  ********************/
.equ HASH_CR_INIT                         ,0x00000004
.equ HASH_CR_DMAE                         ,0x00000008
.equ HASH_CR_DATATYPE                     ,0x00000030
.equ HASH_CR_DATATYPE_0                   ,0x00000010
.equ HASH_CR_DATATYPE_1                   ,0x00000020
.equ HASH_CR_MODE                         ,0x00000040
.equ HASH_CR_ALGO                         ,0x00000080
.equ HASH_CR_NBW                          ,0x00000F00
.equ HASH_CR_NBW_0                        ,0x00000100
.equ HASH_CR_NBW_1                        ,0x00000200
.equ HASH_CR_NBW_2                        ,0x00000400
.equ HASH_CR_NBW_3                        ,0x00000800
.equ HASH_CR_DINNE                        ,0x00001000
.equ HASH_CR_LKEY                         ,0x00010000

