ogneyar/AsmStudy/STM32asm/Examples/projectLCD/src/stm32f40x_def.inc
@*****************  Bits definition for HASH_STR register  *******************/
.equ HASH_STR_NBW                         ,0x0000001F
.equ HASH_STR_NBW_0                       ,0x00000001
.equ HASH_STR_NBW_1                       ,0x00000002
.equ HASH_STR_NBW_2                       ,0x00000004
.equ HASH_STR_NBW_3                       ,0x00000008
.equ HASH_STR_NBW_4                       ,0x00000010
.equ HASH_STR_DCAL                        ,0x00000100

@*****************  Bits definition for HASH_IMR register  *******************/
.equ HASH_IMR_DINIM                       ,0x00000001
.equ HASH_IMR_DCIM                        ,0x00000002

@*****************  Bits definition for HASH_SR register  ********************/
.equ HASH_SR_DINIS                        ,0x00000001
.equ HASH_SR_DCIS                         ,0x00000002
.equ HASH_SR_DMAS                         ,0x00000004
.equ HASH_SR_BUSY                         ,0x00000008

@******************************************************************************/
@*                                                                            */
@*                      Inter-integrated Circuit Interface                    */
@*                                                                            */
@******************************************************************************/
@******************  Bit definition for I2C_CR1 register  ********************/
.equ  I2C_CR1_PE                          ,0x0001            @<Peripheral Enable */
.equ  I2C_CR1_SMBUS                       ,0x0002            @<SMBus Mode */
.equ  I2C_CR1_SMBTYPE                     ,0x0008            @<SMBus Type */
.equ  I2C_CR1_ENARP                       ,0x0010            @<ARP Enable */
.equ  I2C_CR1_ENPEC                       ,0x0020            @<PEC Enable */
.equ  I2C_CR1_ENGC                        ,0x0040            @<General Call Enable */
.equ  I2C_CR1_NOSTRETCH                   ,0x0080            @<Clock Stretching Disable (Slave mode) */
.equ  I2C_CR1_START                       ,0x0100            @<Start Generation */
.equ  I2C_CR1_STOP                        ,0x0200            @<Stop Generation */
.equ  I2C_CR1_ACK                         ,0x0400            @<Acknowledge Enable */
.equ  I2C_CR1_POS                         ,0x0800            @<Acknowledge/PEC Position (for data reception) */
.equ  I2C_CR1_PEC                         ,0x1000            @<Packet Error Checking */
.equ  I2C_CR1_ALERT                       ,0x2000            @<SMBus Alert */
.equ  I2C_CR1_SWRST                       ,0x8000            @<Software Reset */

@******************  Bit definition for I2C_CR2 register  ********************/
.equ  I2C_CR2_FREQ                        ,0x003F            @<FREQ[5:0] bits (Peripheral Clock Frequency) */
.equ  I2C_CR2_FREQ_0                      ,0x0001            @<Bit 0 */
.equ  I2C_CR2_FREQ_1                      ,0x0002            @<Bit 1 */
.equ  I2C_CR2_FREQ_2                      ,0x0004            @<Bit 2 */
.equ  I2C_CR2_FREQ_3                      ,0x0008            @<Bit 3 */
.equ  I2C_CR2_FREQ_4                      ,0x0010            @<Bit 4 */
.equ  I2C_CR2_FREQ_5                      ,0x0020            @<Bit 5 */

.equ  I2C_CR2_ITERREN                     ,0x0100            @<Error Interrupt Enable */
.equ  I2C_CR2_ITEVTEN                     ,0x0200            @<Event Interrupt Enable */
.equ  I2C_CR2_ITBUFEN                     ,0x0400            @<Buffer Interrupt Enable */
.equ  I2C_CR2_DMAEN                       ,0x0800            @<DMA Requests Enable */
.equ  I2C_CR2_LAST                        ,0x1000            @<DMA Last Transfer */

@******************  Bit definition for I2C_OAR1 register  *******************/
.equ  I2C_OAR1_ADD1_7                     ,0x00FE            @<Interface Address */
.equ  I2C_OAR1_ADD8_9                     ,0x0300            @<Interface Address */

.equ  I2C_OAR1_ADD0                       ,0x0001            @<Bit 0 */
.equ  I2C_OAR1_ADD1                       ,0x0002            @<Bit 1 */
.equ  I2C_OAR1_ADD2                       ,0x0004            @<Bit 2 */
.equ  I2C_OAR1_ADD3                       ,0x0008            @<Bit 3 */
.equ  I2C_OAR1_ADD4                       ,0x0010            @<Bit 4 */
.equ  I2C_OAR1_ADD5                       ,0x0020            @<Bit 5 */
.equ  I2C_OAR1_ADD6                       ,0x0040            @<Bit 6 */
.equ  I2C_OAR1_ADD7                       ,0x0080            @<Bit 7 */
.equ  I2C_OAR1_ADD8                       ,0x0100            @<Bit 8 */
.equ  I2C_OAR1_ADD9                       ,0x0200            @<Bit 9 */

.equ  I2C_OAR1_ADDMODE                    ,0x8000            @<Addressing Mode (Slave mode) */

@******************  Bit definition for I2C_OAR2 register  *******************/
.equ  I2C_OAR2_ENDUAL                     ,0x01               @<Dual addressing mode enable */
.equ  I2C_OAR2_ADD2                       ,0xFE               @<Interface address */

@*******************  Bit definition for I2C_DR register  ********************/
.equ  I2C_DR_DR                           ,0xFF               @<8-bit Data Register */

@******************  Bit definition for I2C_SR1 register  ********************/
.equ  I2C_SR1_SB                          ,0x0001            @<Start Bit (Master mode) */
.equ  I2C_SR1_ADDR                        ,0x0002            @<Address sent (master mode)/matched (slave mode) */
.equ  I2C_SR1_BTF                         ,0x0004            @<Byte Transfer Finished */
.equ  I2C_SR1_ADD10                       ,0x0008            @<10-bit header sent (Master mode) */
.equ  I2C_SR1_STOPF                       ,0x0010            @<Stop detection (Slave mode) */
.equ  I2C_SR1_RXNE                        ,0x0040            @<Data Register not Empty (receivers) */
.equ  I2C_SR1_TXE                         ,0x0080            @<Data Register Empty (transmitters) */
.equ  I2C_SR1_BERR                        ,0x0100            @<Bus Error */
.equ  I2C_SR1_ARLO                        ,0x0200            @<Arbitration Lost (master mode) */
.equ  I2C_SR1_AF                          ,0x0400            @<Acknowledge Failure */
.equ  I2C_SR1_OVR                         ,0x0800            @<Overrun/Underrun */
.equ  I2C_SR1_PECERR                      ,0x1000            @<PEC Error in reception */
.equ  I2C_SR1_TIMEOUT                     ,0x4000            @<Timeout or Tlow Error */
.equ  I2C_SR1_SMBALERT                    ,0x8000            @<SMBus Alert */

