ogneyar/AsmStudy/STM32asm/Examples/projectLCD/src/stm32f40x_def.inc
.equ  RCC_AHB1ENR_GPIOGEN                 ,0x00000040
.equ  RCC_AHB1ENR_GPIOGEN_N               ,0x06

.equ  RCC_AHB1ENR_GPIOHEN                 ,0x00000080
.equ  RCC_AHB1ENR_GPIOHEN_N               ,0x07

.equ  RCC_AHB1ENR_GPIOIEN                 ,0x00000100
.equ  RCC_AHB1ENR_GPIOIEN_N               ,0x08

.equ  RCC_AHB1ENR_CRCEN                   ,0x00001000
.equ  RCC_AHB1ENR_CRCEN_N                 ,12

.equ  RCC_AHB1ENR_BKPSRAMEN               ,0x00040000
.equ  RCC_AHB1ENR_BKPSRAMEN_N             ,18

.equ  RCC_AHB1ENR_CCMDATARAMEN            ,0x00100000
.equ  RCC_AHB1ENR_CCMDATARAMEN_N          ,20

.equ  RCC_AHB1ENR_DMA1EN                  ,0x00200000
.equ  RCC_AHB1ENR_DMA1EN_N                ,21

.equ  RCC_AHB1ENR_DMA2EN                  ,0x00400000
.equ  RCC_AHB1ENR_DMA2EN_N                ,22

.equ  RCC_AHB1ENR_ETHMACEN                ,0x02000000
.equ  RCC_AHB1ENR_ETHMACEN_N              ,25

.equ  RCC_AHB1ENR_ETHMACTXEN              ,0x04000000
.equ  RCC_AHB1ENR_ETHMACTXEN_N            ,26

.equ  RCC_AHB1ENR_ETHMACRXEN              ,0x08000000
.equ  RCC_AHB1ENR_ETHMACRXEN_N            ,27

.equ  RCC_AHB1ENR_ETHMACPTPEN             ,0x10000000
.equ  RCC_AHB1ENR_ETHMACPTPEN_N           ,28

.equ  RCC_AHB1ENR_OTGHSEN                 ,0x20000000
.equ  RCC_AHB1ENR_OTGHSEN_N               ,29

.equ  RCC_AHB1ENR_OTGHSULPIEN             ,0x40000000
.equ  RCC_AHB1ENR_OTGHSULPIEN_N           ,30


.equ  RCC_AHB2ENR			  ,0x34
@*******************  Bit definition for RCC_AHB2ENR register  ***************/
.equ  RCC_AHB2ENR_DCMIEN                  ,0x00000001
.equ  RCC_AHB2ENR_CRYPEN                  ,0x00000010
.equ  RCC_AHB2ENR_HASHEN                  ,0x00000020
.equ  RCC_AHB2ENR_RNGEN                   ,0x00000040
.equ  RCC_AHB2ENR_OTGFSEN                 ,0x00000080

.equ  RCC_AHB3ENR			  ,0x38
@*******************  Bit definition for RCC_AHB3ENR register  ***************/
.equ  RCC_AHB3ENR_FSMCEN                  ,0x00000001

.equ  RCC_APB1ENR			  ,0x40
@*******************  Bit definition for RCC_APB1ENR register  ***************/
.equ  RCC_APB1ENR_TIM2EN                  ,0x00000001
.equ  RCC_APB1ENR_TIM3EN                  ,0x00000002
.equ  RCC_APB1ENR_TIM4EN                  ,0x00000004
.equ  RCC_APB1ENR_TIM5EN                  ,0x00000008
.equ  RCC_APB1ENR_TIM6EN                  ,0x00000010
.equ  RCC_APB1ENR_TIM7EN                  ,0x00000020
.equ  RCC_APB1ENR_TIM12EN                 ,0x00000040
.equ  RCC_APB1ENR_TIM13EN                 ,0x00000080
.equ  RCC_APB1ENR_TIM14EN                 ,0x00000100
.equ  RCC_APB1ENR_WWDGEN                  ,0x00000800

.equ  RCC_APB1ENR_SPI2EN                  ,0x00004000
.equ  RCC_APB1ENR_SPI2EN_N                ,14

.equ  RCC_APB1ENR_SPI3EN                  ,0x00008000
.equ  RCC_APB1ENR_USART2EN                ,0x00020000
.equ  RCC_APB1ENR_USART3EN                ,0x00040000
.equ  RCC_APB1ENR_UART4EN                 ,0x00080000
.equ  RCC_APB1ENR_UART5EN                 ,0x00100000
.equ  RCC_APB1ENR_I2C1EN                  ,0x00200000
.equ  RCC_APB1ENR_I2C2EN                  ,0x00400000
.equ  RCC_APB1ENR_I2C3EN                  ,0x00800000
.equ  RCC_APB1ENR_CAN1EN                  ,0x02000000
.equ  RCC_APB1ENR_CAN2EN                  ,0x04000000

.equ  RCC_APB1ENR_PWREN                   ,0x10000000
.equ  RCC_APB1ENR_PWREN_N                 ,28

.equ  RCC_APB1ENR_DACEN                   ,0x20000000

@*******************  Bit definition for RCC_APB2ENR register  ***************/
.equ  RCC_APB2ENR_TIM1EN                  ,0x00000001
.equ  RCC_APB2ENR_TIM8EN                  ,0x00000002
.equ  RCC_APB2ENR_USART1EN                ,0x00000010
.equ  RCC_APB2ENR_USART6EN                ,0x00000020
.equ  RCC_APB2ENR_ADC1EN                  ,0x00000100
.equ  RCC_APB2ENR_ADC2EN                  ,0x00000200
.equ  RCC_APB2ENR_ADC3EN                  ,0x00000400
.equ  RCC_APB2ENR_SDIOEN                  ,0x00000800
.equ  RCC_APB2ENR_SPI1EN                  ,0x00001000
.equ  RCC_APB2ENR_SYSCFGEN                ,0x00004000
.equ  RCC_APB2ENR_TIM11EN                 ,0x00040000
.equ  RCC_APB2ENR_TIM10EN                 ,0x00020000
.equ  RCC_APB2ENR_TIM9EN                  ,0x00010000

.equ  RCC_AHB1LPENR			  ,0x50
@*******************  Bit definition for RCC_AHB1LPENR register  *************/
.equ  RCC_AHB1LPENR_GPIOALPEN             ,0x00000001
.equ  RCC_AHB1LPENR_GPIOBLPEN             ,0x00000002
.equ  RCC_AHB1LPENR_GPIOCLPEN             ,0x00000004
.equ  RCC_AHB1LPENR_GPIODLPEN             ,0x00000008
.equ  RCC_AHB1LPENR_GPIOELPEN             ,0x00000010
.equ  RCC_AHB1LPENR_GPIOFLPEN             ,0x00000020
.equ  RCC_AHB1LPENR_GPIOGLPEN             ,0x00000040
.equ  RCC_AHB1LPENR_GPIOHLPEN             ,0x00000080
.equ  RCC_AHB1LPENR_GPIOILPEN             ,0x00000100
.equ  RCC_AHB1LPENR_CRCLPEN               ,0x00001000
.equ  RCC_AHB1LPENR_FLITFLPEN             ,0x00008000
.equ  RCC_AHB1LPENR_SRAM1LPEN             ,0x00010000
.equ  RCC_AHB1LPENR_SRAM2LPEN             ,0x00020000
.equ  RCC_AHB1LPENR_BKPSRAMLPEN           ,0x00040000
.equ  RCC_AHB1LPENR_DMA1LPEN              ,0x00200000
.equ  RCC_AHB1LPENR_DMA2LPEN              ,0x00400000
.equ  RCC_AHB1LPENR_ETHMACLPEN            ,0x02000000
.equ  RCC_AHB1LPENR_ETHMACTXLPEN          ,0x04000000
.equ  RCC_AHB1LPENR_ETHMACRXLPEN          ,0x08000000
.equ  RCC_AHB1LPENR_ETHMACPTPLPEN         ,0x10000000
.equ  RCC_AHB1LPENR_OTGHSLPEN             ,0x20000000
.equ  RCC_AHB1LPENR_OTGHSULPILPEN         ,0x40000000

.equ  RCC_AHB2LPENR			  ,0x54
@*******************  Bit definition for RCC_AHB2LPENR register  *************/
.equ  RCC_AHB2LPENR_DCMILPEN              ,0x00000001
.equ  RCC_AHB2LPENR_CRYPLPEN              ,0x00000010
.equ  RCC_AHB2LPENR_HASHLPEN              ,0x00000020
.equ  RCC_AHB2LPENR_RNGLPEN               ,0x00000040
.equ  RCC_AHB2LPENR_OTGFSLPEN             ,0x00000080

.equ  RCC_AHB3LPENR			  ,0x58
@*******************  Bit definition for RCC_AHB3LPENR register  *************/
.equ  RCC_AHB3LPENR_FSMCLPEN              ,0x00000001

