ogneyar/AsmStudy/STM32asm/Examples/projectLCD/src/stm32f40x_def.inc
.equ  RCC_APB1LPENR			  ,0x60
@*******************  Bit definition for RCC_APB1LPENR register  *************/
.equ  RCC_APB1LPENR_TIM2LPEN              ,0x00000001
.equ  RCC_APB1LPENR_TIM3LPEN              ,0x00000002
.equ  RCC_APB1LPENR_TIM4LPEN              ,0x00000004
.equ  RCC_APB1LPENR_TIM5LPEN              ,0x00000008
.equ  RCC_APB1LPENR_TIM6LPEN              ,0x00000010
.equ  RCC_APB1LPENR_TIM7LPEN              ,0x00000020
.equ  RCC_APB1LPENR_TIM12LPEN             ,0x00000040
.equ  RCC_APB1LPENR_TIM13LPEN             ,0x00000080
.equ  RCC_APB1LPENR_TIM14LPEN             ,0x00000100
.equ  RCC_APB1LPENR_WWDGLPEN              ,0x00000800
.equ  RCC_APB1LPENR_SPI2LPEN              ,0x00004000
.equ  RCC_APB1LPENR_SPI3LPEN              ,0x00008000
.equ  RCC_APB1LPENR_USART2LPEN            ,0x00020000
.equ  RCC_APB1LPENR_USART3LPEN            ,0x00040000
.equ  RCC_APB1LPENR_UART4LPEN             ,0x00080000
.equ  RCC_APB1LPENR_UART5LPEN             ,0x00100000
.equ  RCC_APB1LPENR_I2C1LPEN              ,0x00200000
.equ  RCC_APB1LPENR_I2C2LPEN              ,0x00400000
.equ  RCC_APB1LPENR_I2C3LPEN              ,0x00800000
.equ  RCC_APB1LPENR_CAN1LPEN              ,0x02000000
.equ  RCC_APB1LPENR_CAN2LPEN              ,0x04000000
.equ  RCC_APB1LPENR_PWRLPEN               ,0x10000000
.equ  RCC_APB1LPENR_DACLPEN               ,0x20000000

.equ  RCC_APB2LPENR			  ,0x64
@*******************  Bit definition for RCC_APB2LPENR register  *************/
.equ  RCC_APB2LPENR_TIM1LPEN              ,0x00000001
.equ  RCC_APB2LPENR_TIM8LPEN              ,0x00000002
.equ  RCC_APB2LPENR_USART1LPEN            ,0x00000010
.equ  RCC_APB2LPENR_USART6LPEN            ,0x00000020
.equ  RCC_APB2LPENR_ADC1LPEN              ,0x00000100
.equ  RCC_APB2LPENR_ADC2PEN               ,0x00000200
.equ  RCC_APB2LPENR_ADC3LPEN              ,0x00000400
.equ  RCC_APB2LPENR_SDIOLPEN              ,0x00000800
.equ  RCC_APB2LPENR_SPI1LPEN              ,0x00001000
.equ  RCC_APB2LPENR_SYSCFGLPEN            ,0x00004000
.equ  RCC_APB2LPENR_TIM9LPEN              ,0x00010000
.equ  RCC_APB2LPENR_TIM10LPEN             ,0x00020000
.equ  RCC_APB2LPENR_TIM11LPEN             ,0x00040000

.equ  RCC_BDCR				  ,0x70
@*******************  Bit definition for RCC_BDCR register  ******************/
.equ  RCC_BDCR_LSEON                      ,0x00000001
.equ  RCC_BDCR_LSERDY                     ,0x00000002
.equ  RCC_BDCR_LSEBYP                     ,0x00000004

.equ  RCC_BDCR_RTCSEL                    ,0x00000300
.equ  RCC_BDCR_RTCSEL_0                  ,0x00000100
.equ  RCC_BDCR_RTCSEL_1                  ,0x00000200

.equ  RCC_BDCR_RTCEN                      ,0x00008000
.equ  RCC_BDCR_BDRST                      ,0x00010000

.equ  RCC_CSR				  ,0x74
@*******************  Bit definition for RCC_CSR register  *******************/
.equ  RCC_CSR_LSION                       ,0x00000001
.equ  RCC_CSR_LSIRDY                      ,0x00000002
.equ  RCC_CSR_RMVF                        ,0x01000000
.equ  RCC_CSR_BORRSTF                     ,0x02000000
.equ  RCC_CSR_PADRSTF                     ,0x04000000
.equ  RCC_CSR_PORRSTF                     ,0x08000000
.equ  RCC_CSR_SFTRSTF                     ,0x10000000
.equ  RCC_CSR_WDGRSTF                     ,0x20000000
.equ  RCC_CSR_WWDGRSTF                    ,0x40000000
.equ  RCC_CSR_LPWRRSTF                    ,0x80000000

.equ  RCC_SSCGR				  ,0x80
@*******************  Bit definition for RCC_SSCGR register  *****************/
.equ  RCC_SSCGR_MODPER                    ,0x00001FFF
.equ  RCC_SSCGR_INCSTEP                   ,0x0FFFE000
.equ  RCC_SSCGR_SPREADSEL                 ,0x40000000
.equ  RCC_SSCGR_SSCGEN                    ,0x80000000

.equ  RCC_PLLI2SCFGR			  ,0x84
@*******************  Bit definition for RCC_PLLI2SCFGR register  ************/
.equ  RCC_PLLI2SCFGR_PLLI2SN              ,0x00007FC0
.equ  RCC_PLLI2SCFGR_PLLI2SR              ,0x70000000

@******************************************************************************/
@*                                                                            */
@*                                    RNG                                     */
@*                                                                            */
@******************************************************************************/
@*******************  Bits definition for RNG_CR register  *******************/
.equ RNG_CR_RNGEN                         ,0x00000004
.equ RNG_CR_IE                            ,0x00000008

@*******************  Bits definition for RNG_SR register  *******************/
.equ RNG_SR_DRDY                          ,0x00000001
.equ RNG_SR_CECS                          ,0x00000002
.equ RNG_SR_SECS                          ,0x00000004
.equ RNG_SR_CEIS                          ,0x00000020
.equ RNG_SR_SEIS                          ,0x00000040

@******************************************************************************/
@*                                                                            */
@*                           Real-Time Clock (RTC)                            */
@*                                                                            */
@******************************************************************************/
@*******************  Bits definition for RTC_TR register  *******************/
.equ RTC_TR_PM                            ,0x00400000
.equ RTC_TR_HT                            ,0x00300000
.equ RTC_TR_HT_0                          ,0x00100000
.equ RTC_TR_HT_1                          ,0x00200000
.equ RTC_TR_HU                            ,0x000F0000
.equ RTC_TR_HU_0                          ,0x00010000
.equ RTC_TR_HU_1                          ,0x00020000
.equ RTC_TR_HU_2                          ,0x00040000
.equ RTC_TR_HU_3                          ,0x00080000
.equ RTC_TR_MNT                           ,0x00007000
.equ RTC_TR_MNT_0                         ,0x00001000
.equ RTC_TR_MNT_1                         ,0x00002000
.equ RTC_TR_MNT_2                         ,0x00004000
.equ RTC_TR_MNU                           ,0x00000F00
.equ RTC_TR_MNU_0                         ,0x00000100
.equ RTC_TR_MNU_1                         ,0x00000200
.equ RTC_TR_MNU_2                         ,0x00000400
.equ RTC_TR_MNU_3                         ,0x00000800
.equ RTC_TR_ST                            ,0x00000070
.equ RTC_TR_ST_0                          ,0x00000010
.equ RTC_TR_ST_1                          ,0x00000020
.equ RTC_TR_ST_2                          ,0x00000040
.equ RTC_TR_SU                            ,0x0000000F
.equ RTC_TR_SU_0                          ,0x00000001
.equ RTC_TR_SU_1                          ,0x00000002
.equ RTC_TR_SU_2                          ,0x00000004
.equ RTC_TR_SU_3                          ,0x00000008

