ogneyar/AsmStudy/STM32asm/Examples/projectLCD/src/stm32f40x_def.inc
@*****************  Bit definition for TIM_CCMR1 register  *******************/
.equ  TIM_CCMR1_CC1S                      ,0x0003             @<CC1S[1:0] bits (Capture/Compare 1 Selection) */
.equ  TIM_CCMR1_CC1S_0                    ,0x0001             @<Bit 0 */
.equ  TIM_CCMR1_CC1S_1                    ,0x0002             @<Bit 1 */

.equ  TIM_CCMR1_OC1FE                     ,0x0004             @<Output Compare 1 Fast enable */
.equ  TIM_CCMR1_OC1PE                     ,0x0008             @<Output Compare 1 Preload enable */

.equ  TIM_CCMR1_OC1M                      ,0x0070             @<OC1M[2:0] bits (Output Compare 1 Mode) */
.equ  TIM_CCMR1_OC1M_0                    ,0x0010             @<Bit 0 */
.equ  TIM_CCMR1_OC1M_1                    ,0x0020             @<Bit 1 */
.equ  TIM_CCMR1_OC1M_2                    ,0x0040             @<Bit 2 */

.equ  TIM_CCMR1_OC1CE                     ,0x0080             @<Output Compare 1Clear Enable */

.equ  TIM_CCMR1_CC2S                      ,0x0300             @<CC2S[1:0] bits (Capture/Compare 2 Selection) */
.equ  TIM_CCMR1_CC2S_0                    ,0x0100             @<Bit 0 */
.equ  TIM_CCMR1_CC2S_1                    ,0x0200             @<Bit 1 */

.equ  TIM_CCMR1_OC2FE                     ,0x0400             @<Output Compare 2 Fast enable */
.equ  TIM_CCMR1_OC2PE                     ,0x0800             @<Output Compare 2 Preload enable */

.equ  TIM_CCMR1_OC2M                      ,0x7000             @<OC2M[2:0] bits (Output Compare 2 Mode) */
.equ  TIM_CCMR1_OC2M_0                    ,0x1000             @<Bit 0 */
.equ  TIM_CCMR1_OC2M_1                    ,0x2000             @<Bit 1 */
.equ  TIM_CCMR1_OC2M_2                    ,0x4000             @<Bit 2 */

.equ  TIM_CCMR1_OC2CE                     ,0x8000             @<Output Compare 2 Clear Enable */

@----------------------------------------------------------------------------*/

.equ  TIM_CCMR1_IC1PSC                    ,0x000C             @<IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
.equ  TIM_CCMR1_IC1PSC_0                  ,0x0004             @<Bit 0 */
.equ  TIM_CCMR1_IC1PSC_1                  ,0x0008             @<Bit 1 */

.equ  TIM_CCMR1_IC1F                      ,0x00F0             @<IC1F[3:0] bits (Input Capture 1 Filter) */
.equ  TIM_CCMR1_IC1F_0                    ,0x0010             @<Bit 0 */
.equ  TIM_CCMR1_IC1F_1                    ,0x0020             @<Bit 1 */
.equ  TIM_CCMR1_IC1F_2                    ,0x0040             @<Bit 2 */
.equ  TIM_CCMR1_IC1F_3                    ,0x0080             @<Bit 3 */

.equ  TIM_CCMR1_IC2PSC                    ,0x0C00             @<IC2PSC[1:0] bits (Input Capture 2 Prescaler) */
.equ  TIM_CCMR1_IC2PSC_0                  ,0x0400             @<Bit 0 */
.equ  TIM_CCMR1_IC2PSC_1                  ,0x0800             @<Bit 1 */

.equ  TIM_CCMR1_IC2F                      ,0xF000             @<IC2F[3:0] bits (Input Capture 2 Filter) */
.equ  TIM_CCMR1_IC2F_0                    ,0x1000             @<Bit 0 */
.equ  TIM_CCMR1_IC2F_1                    ,0x2000             @<Bit 1 */
.equ  TIM_CCMR1_IC2F_2                    ,0x4000             @<Bit 2 */
.equ  TIM_CCMR1_IC2F_3                    ,0x8000             @<Bit 3 */

@*****************  Bit definition for TIM_CCMR2 register  *******************/
.equ  TIM_CCMR2_CC3S                      ,0x0003             @<CC3S[1:0] bits (Capture/Compare 3 Selection) */
.equ  TIM_CCMR2_CC3S_0                    ,0x0001             @<Bit 0 */
.equ  TIM_CCMR2_CC3S_1                    ,0x0002             @<Bit 1 */

.equ  TIM_CCMR2_OC3FE                     ,0x0004             @<Output Compare 3 Fast enable */
.equ  TIM_CCMR2_OC3PE                     ,0x0008             @<Output Compare 3 Preload enable */

.equ  TIM_CCMR2_OC3M                      ,0x0070             @<OC3M[2:0] bits (Output Compare 3 Mode) */
.equ  TIM_CCMR2_OC3M_0                    ,0x0010             @<Bit 0 */
.equ  TIM_CCMR2_OC3M_1                    ,0x0020             @<Bit 1 */
.equ  TIM_CCMR2_OC3M_2                    ,0x0040             @<Bit 2 */

.equ  TIM_CCMR2_OC3CE                     ,0x0080             @<Output Compare 3 Clear Enable */

.equ  TIM_CCMR2_CC4S                      ,0x0300             @<CC4S[1:0] bits (Capture/Compare 4 Selection) */
.equ  TIM_CCMR2_CC4S_0                    ,0x0100             @<Bit 0 */
.equ  TIM_CCMR2_CC4S_1                    ,0x0200             @<Bit 1 */

.equ  TIM_CCMR2_OC4FE                     ,0x0400             @<Output Compare 4 Fast enable */
.equ  TIM_CCMR2_OC4PE                     ,0x0800             @<Output Compare 4 Preload enable */

.equ  TIM_CCMR2_OC4M                      ,0x7000             @<OC4M[2:0] bits (Output Compare 4 Mode) */
.equ  TIM_CCMR2_OC4M_0                    ,0x1000             @<Bit 0 */
.equ  TIM_CCMR2_OC4M_1                    ,0x2000             @<Bit 1 */
.equ  TIM_CCMR2_OC4M_2                    ,0x4000             @<Bit 2 */

.equ  TIM_CCMR2_OC4CE                     ,0x8000             @<Output Compare 4 Clear Enable */

@----------------------------------------------------------------------------*/

.equ  TIM_CCMR2_IC3PSC                    ,0x000C             @<IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
.equ  TIM_CCMR2_IC3PSC_0                  ,0x0004             @<Bit 0 */
.equ  TIM_CCMR2_IC3PSC_1                  ,0x0008             @<Bit 1 */

.equ  TIM_CCMR2_IC3F                      ,0x00F0             @<IC3F[3:0] bits (Input Capture 3 Filter) */
.equ  TIM_CCMR2_IC3F_0                    ,0x0010             @<Bit 0 */
.equ  TIM_CCMR2_IC3F_1                    ,0x0020             @<Bit 1 */
.equ  TIM_CCMR2_IC3F_2                    ,0x0040             @<Bit 2 */
.equ  TIM_CCMR2_IC3F_3                    ,0x0080             @<Bit 3 */

.equ  TIM_CCMR2_IC4PSC                    ,0x0C00             @<IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
.equ  TIM_CCMR2_IC4PSC_0                  ,0x0400             @<Bit 0 */
.equ  TIM_CCMR2_IC4PSC_1                  ,0x0800             @<Bit 1 */

.equ  TIM_CCMR2_IC4F                      ,0xF000             @<IC4F[3:0] bits (Input Capture 4 Filter) */
.equ  TIM_CCMR2_IC4F_0                    ,0x1000             @<Bit 0 */
.equ  TIM_CCMR2_IC4F_1                    ,0x2000             @<Bit 1 */
.equ  TIM_CCMR2_IC4F_2                    ,0x4000             @<Bit 2 */
.equ  TIM_CCMR2_IC4F_3                    ,0x8000             @<Bit 3 */

