ogneyar/AsmStudy/STM32asm/Examples/projectLCD/src/stm32f40x_def.inc
.equ  WWDG_CFR_WDGTB                      ,0x0180             @<WDGTB[1:0] bits (Timer Base) */
.equ  WWDG_CFR_WDGTB0                     ,0x0080             @<Bit 0 */
.equ  WWDG_CFR_WDGTB1                     ,0x0100             @<Bit 1 */

.equ  WWDG_CFR_EWI                        ,0x0200             @<Early Wakeup Interrupt */

@******************  Bit definition for WWDG_SR register  ********************/
.equ  WWDG_SR_EWIF                        ,0x01               @<Early Wakeup Interrupt Flag */


@******************************************************************************/
@*                                                                            */
@*                                DBG                                         */
@*                                                                            */
@******************************************************************************/
@*******************  Bit definition for DBGMCU_IDCODE register  *************/
.equ  DBGMCU_IDCODE_DEV_ID                ,0x00000FFF
.equ  DBGMCU_IDCODE_REV_ID                ,0xFFFF0000

@*******************  Bit definition for DBGMCU_CR register  *****************/
.equ  DBGMCU_CR_DBG_SLEEP                 ,0x00000001
.equ  DBGMCU_CR_DBG_STOP                  ,0x00000002
.equ  DBGMCU_CR_DBG_STANDBY               ,0x00000004
.equ  DBGMCU_CR_TRACE_IOEN                ,0x00000020

.equ  DBGMCU_CR_TRACE_MODE                ,0x000000C0
.equ  DBGMCU_CR_TRACE_MODE_0              ,0x00000040   @<Bit 0 */
.equ  DBGMCU_CR_TRACE_MODE_1              ,0x00000080   @<Bit 1 */

@*******************  Bit definition for DBGMCU_APB1_FZ register  ************/
.equ  DBGMCU_APB1_FZ_DBG_TIM2_STOP            ,0x00000001
.equ  DBGMCU_APB1_FZ_DBG_TIM3_STOP            ,0x00000002
.equ  DBGMCU_APB1_FZ_DBG_TIM4_STOP            ,0x00000004
.equ  DBGMCU_APB1_FZ_DBG_TIM5_STOP            ,0x00000008
.equ  DBGMCU_APB1_FZ_DBG_TIM6_STOP            ,0x00000010
.equ  DBGMCU_APB1_FZ_DBG_TIM7_STOP            ,0x00000020
.equ  DBGMCU_APB1_FZ_DBG_TIM12_STOP           ,0x00000040
.equ  DBGMCU_APB1_FZ_DBG_TIM13_STOP           ,0x00000080
.equ  DBGMCU_APB1_FZ_DBG_TIM14_STOP           ,0x00000100
.equ  DBGMCU_APB1_FZ_DBG_RTC_STOP             ,0x00000400
.equ  DBGMCU_APB1_FZ_DBG_WWDG_STOP            ,0x00000800
.equ  DBGMCU_APB1_FZ_DBG_IWDG_STOP            ,0x00001000
.equ  DBGMCU_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT   ,0x00200000
.equ  DBGMCU_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT   ,0x00400000
.equ  DBGMCU_APB1_FZ_DBG_I2C3_SMBUS_TIMEOUT   ,0x00800000
.equ  DBGMCU_APB1_FZ_DBG_CAN1_STOP            ,0x02000000
.equ  DBGMCU_APB1_FZ_DBG_CAN2_STOP            ,0x04000000

@ Old IWDGSTOP bit definition, maintained for legacy purpose */
.equ  DBGMCU_APB1_FZ_DBG_IWDEG_STOP           ,DBGMCU_APB1_FZ_DBG_IWDG_STOP

@*******************  Bit definition for DBGMCU_APB2_FZ register  ************/
.equ  DBGMCU_APB1_FZ_DBG_TIM1_STOP        ,0x00000001
.equ  DBGMCU_APB1_FZ_DBG_TIM8_STOP        ,0x00000002
.equ  DBGMCU_APB1_FZ_DBG_TIM9_STOP        ,0x00010000
.equ  DBGMCU_APB1_FZ_DBG_TIM10_STOP       ,0x00020000
.equ  DBGMCU_APB1_FZ_DBG_TIM11_STOP       ,0x00040000

@******************************************************************************/
@*                                                                            */
@*                Ethernet MAC Registers bits definitions                     */
@*                                                                            */
@******************************************************************************/
@ Bit definition for Ethernet MAC Control Register register */
.equ ETH_MACCR_WD              ,0x00800000       @ Watchdog disable */
.equ ETH_MACCR_JD              ,0x00400000       @ Jabber disable */
.equ ETH_MACCR_IFG             ,0x000E0000       @ Inter-frame gap */
.equ ETH_MACCR_IFG_96Bit       ,0x00000000       @ Minimum IFG between frames during transmission is 96Bit */
.equ ETH_MACCR_IFG_88Bit     ,0x00020000       @ Minimum IFG between frames during transmission is 88Bit */
.equ ETH_MACCR_IFG_80Bit     ,0x00040000       @ Minimum IFG between frames during transmission is 80Bit */
.equ ETH_MACCR_IFG_72Bit     ,0x00060000       @ Minimum IFG between frames during transmission is 72Bit */
.equ ETH_MACCR_IFG_64Bit     ,0x00080000       @ Minimum IFG between frames during transmission is 64Bit */        
.equ ETH_MACCR_IFG_56Bit     ,0x000A0000       @ Minimum IFG between frames during transmission is 56Bit */
.equ ETH_MACCR_IFG_48Bit     ,0x000C0000       @ Minimum IFG between frames during transmission is 48Bit */
.equ ETH_MACCR_IFG_40Bit     ,0x000E0000       @ Minimum IFG between frames during transmission is 40Bit */              
.equ ETH_MACCR_CSD     ,0x00010000       @ Carrier sense disable (during transmission) */
.equ ETH_MACCR_FES     ,0x00004000       @ Fast ethernet speed */
.equ ETH_MACCR_ROD     ,0x00002000       @ Receive own disable */
.equ ETH_MACCR_LM      ,0x00001000       @ loopback mode */
.equ ETH_MACCR_DM      ,0x00000800       @ Duplex mode */
.equ ETH_MACCR_IPCO    ,0x00000400       @ IP Checksum offload */
.equ ETH_MACCR_RD      ,0x00000200       @ Retry disable */
.equ ETH_MACCR_APCS    ,0x00000080       @ Automatic Pad/CRC stripping */
.equ ETH_MACCR_BL      ,0x00000060       @ Back-off limit: random integer number (r) of slot time delays before rescheduling
                                         @              a transmission attempt during retries after a collision: 0 =< r <2^k */
.equ ETH_MACCR_BL_10    ,0x00000000       @ k = min (n, 10) */
.equ ETH_MACCR_BL_8     ,0x00000020       @ k = min (n, 8) */
.equ ETH_MACCR_BL_4     ,0x00000040       @ k = min (n, 4) */
.equ ETH_MACCR_BL_1     ,0x00000060       @ k = min (n, 1) */ 
.equ ETH_MACCR_DC      ,0x00000010       @ Defferal check */
.equ ETH_MACCR_TE      ,0x00000008       @ Transmitter enable */
.equ ETH_MACCR_RE      ,0x00000004       @ Receiver enable */

@ Bit definition for Ethernet MAC Frame Filter Register */
.equ ETH_MACFFR_RA     ,0x80000000       @ Receive all */ 
.equ ETH_MACFFR_HPF    ,0x00000400       @ Hash or perfect filter */ 
.equ ETH_MACFFR_SAF    ,0x00000200       @ Source address filter enable */ 
.equ ETH_MACFFR_SAIF   ,0x00000100       @ SA inverse filtering */ 
.equ ETH_MACFFR_PCF    ,0x000000C0       @ Pass control frames: 3 cases */
.equ ETH_MACFFR_PCF_BlockAll                ,0x00000040       @ MAC filters all control frames from reaching the application */
.equ ETH_MACFFR_PCF_ForwardAll              ,0x00000080       @ MAC forwards all control frames to application even if they fail the Address Filter */
.equ ETH_MACFFR_PCF_ForwardPassedAddrFilter ,0x000000C0       @ MAC forwards control frames that pass the Address Filter. */ 
.equ ETH_MACFFR_BFD    ,0x00000020       @ Broadcast frame disable */ 
.equ ETH_MACFFR_PAM    ,0x00000010       @ Pass all mutlicast */ 
.equ ETH_MACFFR_DAIF   ,0x00000008       @ DA Inverse filtering */ 
.equ ETH_MACFFR_HM     ,0x00000004       @ Hash multicast */ 
.equ ETH_MACFFR_HU     ,0x00000002       @ Hash unicast */
.equ ETH_MACFFR_PM     ,0x00000001       @ Promiscuous mode */

@ Bit definition for Ethernet MAC Hash Table High Register */
.equ ETH_MACHTHR_HTH   ,0xFFFFFFFF       @ Hash table high */

