ogneyar/AsmStudy/STM32asm/Examples/projectLCD/src/stm32f40x_def.inc
@ Bit definition for Ethernet DMA Current Host Transmit Buffer Address Register */
.equ ETH_DMACHTBAR_HTBAP  ,0xFFFFFFFF       @ Host transmit buffer address pointer */

@ Bit definition for Ethernet DMA Current Host Receive Buffer Address Register */
.equ ETH_DMACHRBAR_HRBAP  ,0xFFFFFFFF       @ Host receive buffer address pointer */

@ ****************************************************************************
@ *                          SysTick timer (STK)                             *
@ ****************************************************************************
@ Внимание !! счетчик работает только если процессор не находиться в режиме
@ пониженного энергопотребления (иначе счет останавливается)
@
.equ STK_CTRL		  ,0x00		    @ Регистр статуса и управления
@ ***************** Bit definition for STK_CTRL Register *********************
.equ STK_CTRL_COUNTFLAG   ,0x00010000       @ (R) читается "1" если был перенос с момента последнего чтения
.equ STK_CTRL_CLKSOURSE   ,0x00000004       @ (RW) источник тактирования: 0: AHB/8; 1: AHB 
.equ STK_CTRL_TICKINT     ,0x00000002       @ (RW) при установке генерирует прерывание при переходе через 0
.equ STK_CTRL_ENABLE      ,0x00000001       @ (EW) включает счетчик. При установке в "1" счетчик загружает 
			@ значение из STK_LOAD и начинает обратный отсчет. При достижении "0" устанавливается
			@ COUNTFLAG и в зависимости от STK_CTRL_TICKINT генерируется прерывание, после этого 
			@ опять загружается исходное значение и начинается отсчет сначала

.equ STK_LOAD		  ,0x00000004	    @ Значение для перезагрузки счетчика 
@ ****************** Bit definition for STK_LOAD Register ********************
@ Значение для счетчика, значение диапазона 0х00000001-0x00FFFFFF.
@ Значение счетчика равное "0" не имеет смысла, так как генерация прерывания и
@ установка флага STK_CTRL_COUNTFLAG происходит при переходе с "1" на "0"
@ Если нужно чтобы флаг устанавливался каждые N (100) тактовых импульсов нужно 
@ установить значение N-1 (99)
@ Если важно только первое одиночное прерывание то для задержки на N (100) 
@ тактовых импульсов установите значение равное N (100)

.equ STK_VAL		  ,0x00000008	    @ Текущее значение счетчика 
@ ******************* Bit definition for STK_VAL Register ********************
@ Текущее значение счетчика, при чтении - значение счетчика, при записи - сброс
@ значения регистра в "0"


.equ STK_CALIB		  ,0x0000000C	    @ Регистр калибровки
@ ******************* Bit definition for STK_CALIB Register ******************
.equ STK_CALIB_NOREF_MASK ,0x80000000

.equ STK_CALIB_SKEW_MASK  ,0x40000000

.equ STK_CALIB_TENMS_MASK ,0x00FFFFFF

@ ****************************************************************************
@ *                          	   NVIC                                      *
@ ****************************************************************************
.equ NVIC_IPRx_BASE	  ,0x300	@ Базовый адрес NVIC_IPR
.equ NVIC_IPR0		  ,0x300	@ Базовый адрес NVIC_IPR0

.equ NonMaskableInt_IRQn  ,-14          @*!< 2 Non Maskable Interrupt                                          */
.equ MemoryManagement_IRQn,-12    	@/*!< 4 Cortex-M4 Memory Management Interrupt                           */
.equ BusFault_IRQn        ,-11          @/*!< 5 Cortex-M4 Bus Fault Interrupt                                   */
.equ UsageFault_IRQn      ,-10	        @/*!< 6 Cortex-M4 Usage Fault Interrupt                                 */
.equ SVCall_IRQn          ,-5           @/*!< 11 Cortex-M4 SV Call Interrupt                                    */
.equ DebugMonitor_IRQn    ,-4           @/*!< 12 Cortex-M4 Debug Monitor Interrupt                              */
.equ PendSV_IRQn          ,-2           @/*!< 14 Cortex-M4 Pend SV Interrupt                                    */
.equ SysTick_IRQn         ,-1           @/*!< 15 Cortex-M4 System Tick Interrupt                                */
@/******  STM32 specific Interrupt Numbers **********************************************************************/
.equ WWDG_IRQn            ,0     	@/*!< Window WatchDog Interrupt                                         */
.equ PVD_IRQn             ,1      	@/*!< PVD through EXTI Line detection Interrupt                         */
.equ TAMP_STAMP_IRQn      ,2      	@/*!< Tamper and TimeStamp interrupts through the EXTI line             */
.equ RTC_WKUP_IRQn        ,3      	@/*!< RTC Wakeup interrupt through the EXTI line                        */
.equ FLASH_IRQn           ,4      	@/*!< FLASH global Interrupt                                            */
.equ RCC_IRQn             ,5      	@/*!< RCC global Interrupt                                              */
.equ EXTI0_IRQn           ,6      	@/*!< EXTI Line0 Interrupt                                              */
.equ EXTI1_IRQn           ,7      	@/*!< EXTI Line1 Interrupt                                              */
.equ EXTI2_IRQn           ,8      	@/*!< EXTI Line2 Interrupt                                              */
.equ EXTI3_IRQn           ,9     	@/*!< EXTI Line3 Interrupt                                              */
.equ EXTI4_IRQn           ,10     	@/*!< EXTI Line4 Interrupt                                              */
.equ DMA1_Stream0_IRQn    ,11     	@/*!< DMA1 Stream 0 global Interrupt                                    */
.equ DMA1_Stream1_IRQn    ,12     	@/*!< DMA1 Stream 1 global Interrupt                                    */
.equ DMA1_Stream2_IRQn    ,13     	@/*!< DMA1 Stream 2 global Interrupt                                    */
.equ DMA1_Stream3_IRQn    ,14     	@/*!< DMA1 Stream 3 global Interrupt                                    */
.equ DMA1_Stream4_IRQn    ,15     	@/*!< DMA1 Stream 4 global Interrupt                                    */
.equ DMA1_Stream5_IRQn    ,16     	@/*!< DMA1 Stream 5 global Interrupt                                    */
.equ DMA1_Stream6_IRQn    ,17     	@/*!< DMA1 Stream 6 global Interrupt                                    */
.equ ADC_IRQn             ,18     	@/*!< ADC1, ADC2 and ADC3 global Interrupts                             */
.equ CAN1_TX_IRQn         ,19     	@/*!< CAN1 TX Interrupt                                                 */
.equ CAN1_RX0_IRQn        ,20     	@/*!< CAN1 RX0 Interrupt                                                */
.equ CAN1_RX1_IRQn        ,21     	@/*!< CAN1 RX1 Interrupt                                                */
.equ CAN1_SCE_IRQn        ,22     	@/*!< CAN1 SCE Interrupt                                                */
.equ EXTI9_5_IRQn         ,23     	@/*!< External Line[9:5] Interrupts                                     */
.equ TIM1_BRK_TIM9_IRQn   ,24     	@/*!< TIM1 Break interrupt and TIM9 global interrupt                    */
.equ TIM1_UP_TIM10_IRQn   ,25     	@/*!< TIM1 Update Interrupt and TIM10 global interrupt                  */
.equ TIM1_TRG_COM_TIM11_IRQn,26     	@/*!< TIM1 Trigger and Commutation Interrupt and TIM11 global interrupt */
.equ TIM1_CC_IRQn         ,27     	@/*!< TIM1 Capture Compare Interrupt                                    */
.equ TIM2_IRQn            ,28     	@/*!< TIM2 global Interrupt                                             */
.equ TIM3_IRQn            ,29     	@/*!< TIM3 global Interrupt                                             */
.equ TIM4_IRQn            ,30     	@/*!< TIM4 global Interrupt                                             */
.equ I2C1_EV_IRQn         ,31     	@/*!< I2C1 Event Interrupt                                              */
.equ I2C1_ER_IRQn         ,32     	@/*!< I2C1 Error Interrupt                                              */
.equ I2C2_EV_IRQn         ,33     	@/*!< I2C2 Event Interrupt                                              */
.equ I2C2_ER_IRQn         ,34     	@/*!< I2C2 Error Interrupt                                              */  
.equ SPI1_IRQn            ,35     	@/*!< SPI1 global Interrupt                                             */
.equ SPI2_IRQn            ,36     	@/*!< SPI2 global Interrupt                                             */
.equ USART1_IRQn          ,37     	@/*!< USART1 global Interrupt                                           */
.equ USART2_IRQn          ,38     	@/*!< USART2 global Interrupt                                           */
.equ USART3_IRQn          ,39     	@/*!< USART3 global Interrupt                                           */
.equ EXTI15_10_IRQn       ,40     	@/*!< External Line[15:10] Interrupts                                   */
.equ RTC_Alarm_IRQn       ,41     	@/*!< RTC Alarm (A and B) through EXTI Line Interrupt                   */
.equ OTG_FS_WKUP_IRQn     ,42     	@/*!< USB OTG FS Wakeup through EXTI line interrupt                     */    
.equ TIM8_BRK_TIM12_IRQn  ,43     	@/*!< TIM8 Break Interrupt and TIM12 global interrupt                   */
.equ TIM8_UP_TIM13_IRQn   ,44     	@/*!< TIM8 Update Interrupt and TIM13 global interrupt                  */
.equ TIM8_TRG_COM_TIM14_IRQn,45     	@/*!< TIM8 Trigger and Commutation Interrupt and TIM14 global interrupt */
.equ TIM8_CC_IRQn         ,46     	@/*!< TIM8 Capture Compare Interrupt                                    */
.equ DMA1_Stream7_IRQn    ,47     	@/*!< DMA1 Stream7 Interrupt                                            */
.equ FSMC_IRQn            ,48     	@/*!< FSMC global Interrupt                                             */
.equ SDIO_IRQn            ,49     	@/*!< SDIO global Interrupt                                             */
.equ TIM5_IRQn            ,50     	@/*!< TIM5 global Interrupt                                             */
.equ SPI3_IRQn            ,51    	@/*!< SPI3 global Interrupt                                             */
.equ UART4_IRQn           ,52     	@/*!< UART4 global Interrupt                                            */
.equ UART5_IRQn           ,53     	@/*!< UART5 global Interrupt                                            */
.equ TIM6_DAC_IRQn        ,54     	@/*!< TIM6 global and DAC1&2 underrun error  interrupts                 */
.equ TIM7_IRQn            ,55     	@/*!< TIM7 global interrupt                                             */
.equ DMA2_Stream0_IRQn    ,56     	@/*!< DMA2 Stream 0 global Interrupt                                    */
.equ DMA2_Stream1_IRQn    ,57     	@/*!< DMA2 Stream 1 global Interrupt                                    */
.equ DMA2_Stream2_IRQn    ,58     	@/*!< DMA2 Stream 2 global Interrupt                                    */
.equ DMA2_Stream3_IRQn    ,59     	@/*!< DMA2 Stream 3 global Interrupt                                    */
.equ DMA2_Stream4_IRQn    ,60     	@/*!< DMA2 Stream 4 global Interrupt                                    */
.equ ETH_IRQn             ,61     	@/*!< Ethernet global Interrupt                                         */
.equ ETH_WKUP_IRQn        ,62     	@/*!< Ethernet Wakeup through EXTI line Interrupt                       */
.equ CAN2_TX_IRQn         ,63     	@/*!< CAN2 TX Interrupt                                                 */
.equ CAN2_RX0_IRQn        ,64     	@/*!< CAN2 RX0 Interrupt                                                */
.equ CAN2_RX1_IRQn        ,65     	@/*!< CAN2 RX1 Interrupt                                                */
.equ CAN2_SCE_IRQn        ,66     	@/*!< CAN2 SCE Interrupt                                                */
.equ OTG_FS_IRQn          ,67     	@/*!< USB OTG FS global Interrupt                                       */
.equ DMA2_Stream5_IRQn    ,68     	@/*!< DMA2 Stream 5 global interrupt                                    */
.equ DMA2_Stream6_IRQn    ,69     	@/*!< DMA2 Stream 6 global interrupt                                    */
.equ DMA2_Stream7_IRQn    ,70     	@/*!< DMA2 Stream 7 global interrupt                                    */
.equ USART6_IRQn          ,71     	@/*!< USART6 global interrupt                                           */ 
.equ I2C3_EV_IRQn         ,72     	@/*!< I2C3 event interrupt                                              */
.equ I2C3_ER_IRQn         ,73     	@/*!< I2C3 error interrupt                                              */
.equ OTG_HS_EP1_OUT_IRQn  ,74     	@/*!< USB OTG HS End Point 1 Out global interrupt                       */
.equ OTG_HS_EP1_IN_IRQn   ,75     	@/*!< USB OTG HS End Point 1 In global interrupt                        */
.equ OTG_HS_WKUP_IRQn     ,76     	@/*!< USB OTG HS Wakeup through EXTI interrupt                          */
.equ OTG_HS_IRQn          ,77     	@/*!< USB OTG HS global interrupt                                       */
.equ DCMI_IRQn            ,78     	@/*!< DCMI global interrupt                                             */
.equ CRYP_IRQn            ,79     	@/*!< CRYP crypto global interrupt                                      */
.equ HASH_RNG_IRQn        ,80      	@/*!< Hash and Rng global interrupt                                     */
.equ FPU_IRQn             ,81      	@/*!< FPU global interrupt                                              */

@ ****************************************************************************
@ *                         System control block (SCB)                       *
@ ****************************************************************************
.equ ACTLR		  ,0xE000E008	@ Auxiliary control register
					@ ВНИМАНИЕ ! адрес определен полностью !
@ ******************* Bit definition for ACTLR Register **********************
.equ ACTRL_DISOOFP        ,0x00000020   @ Отключение инструкций с плавающей точкой
.equ ACTRL_DISFPCA        ,0x00000010   @ Отключение автообновления CONTROL.FPCA
.equ ACTRL_DISFOLD        ,0x00000004   @ Отключение сворачивания IT инструкций
.equ ACTRL_DISDEFWBUF     ,0x00000002   @ Отключение буфера на запись в память (?)
.equ ACTRL_DISMCYCINT     ,0x00000001   @ Отключение прерывания многоцикличных инструкций

@ базовый адрес SCB_BASE = 0xE000ED00 
.equ CPUID		  ,0x00		@ CPUID base register

.equ ICSR		  ,0x04   	@ Interrupt control and state register
@ ******************* Bit definition for ICSR Register ***********************
.equ ICSR_NMIPENDSET      ,0x80000000   @ NMI set-pending bit
.equ ICSR_PENDSVSET       ,0x10000000   @ PendSV set-pending bit
.equ ICSR_PENDSVCLR       ,0x08000000   @ PendSV clear-pending bit. This bit is write-only. On a read, value is unknown
.equ ICSR_PENDSTSET       ,0x04000000   @ SysTick exception set-pending bit
.equ ICSR_PENDSTCLR       ,0x02000000   @ SysTick exception clear-pending bit. Write-only. On a read, value is unknown
.equ ICSR_ISRPENDING      ,0x00400000   @ Interrupt pending flag, excluding NMI and Faults
.equ ICSR_VECTPENDING_MASK,0x0007F000   @ Pending vector. Indicates the exception number of the highest priority pending enabled exception
.equ ICSR_RETTOBASE       ,0x00000800   @ Return to base level. Indicates whether there are preempted active exceptions
.equ ICSR_VECTACTIVE      ,0x000001FF   @ Active vector. Contains the active exception number

.equ VTOR		  ,0x08         @ Vector table offset register

.equ AIRCR		  ,0x0C         @ Application interrupt and reset control register

.equ SCR		  ,0x10		@ System control register (SCR)

.equ CCR		  ,0x14         @ Configuration and control register (CCR)

.equ SHPR1        ,0x18         @ System handler priority registers (SHPRx)

.equ SHPR2        ,0x1C         @ System handler priority registers (SHPRx)

.equ SHPR3        ,0x20         @ System handler priority registers (SHPRx)

.equ SHCRS        ,0x24         @ System handler control and state register (SHCSR)

.equ CFSR		  ,0x28         @ Configurable fault status register (CFSR; UFSR+BFSR+MMFSR)

.equ MMSR		  ,0x28         @ MemManage Fault Status Register

.equ BFSR		  ,0x29         @ BusFault Status Register

.equ UFSR         ,0x2A         @ UsageFault Status Register

.equ HFSR         ,0x2C         @ Hard fault status register (HFSR)

.equ MMAR         ,0x34         @ Memory management fault address register (MMFAR)

.equ BFAR		  ,0x38         @ Bus fault address register (BFAR)

.equ AFSR         ,0x3C         @ Auxiliary fault status register (AFSR) 
